package day0118;
// 주석 ( comment )
// 주석이란 우리가 소스 파일 안에
// 적는 설명으로써
// 실제 컴파일 단계에서는
// 무시가 되는 글자들이다.
// 주석이 아닌 모든 것들은 코드로써
// 자바의 엄격한 문법에 어긋나지 않아야 하지만
// 주석들은 무시가 되기 때문에 우리가 문법을 안 지켜줘도 된다.

// 주석은 주로 어떤 코드에 대한 설명을 적게 된다.
// 해당 코드가 어떤 역할을 하는지, 왜 이렇게 적었는지 등에 대한 설명을 적어서
// 이 코드를 읽는 사람들에게 설명을 하는 역할을 한다.

// 주석에는 한줄 주석과 여러줄 주석 두가지 주석이 있다.

// 한줄 주석: // 로 시작하고 그 다음칸부터 그 줄이 끝날때까지가 주석이 된다.
// 여러줄 주석: /* 로 시작해서 */로 끝날떄 까지 그 사이의 모든 줄이 주석이 된다.


public class Ex01Comment {
    public static void main (String[] args) {
        
    }
 
}
